### 🏗️ Terraform Plan - Production

#### Initialization: `success`
#### Validation: `success`
#### Plan: `success`

<details><summary>Show Plan Output</summary>

```hcl
data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDA1ODgzZC01ODYxLTQ3YjctOWQ3YS0xNzc2MjVkYTY4MTE7b2JqZWN0SWQ9MGE4NDgwYmQtMmI0MS00NDlmLWIxNmUtYmFkZDU2MTZhZTE1O3N1YnNjcmlwdGlvbklkPTI4YWVmYmU3LWUyYWYtNGI0YS05Y2UxLTkyZDY2NzJjMzFiZDt0ZW5hbnRJZD1jMmQ3MjNhMi00NzRlLTQ0ZDItYTM3Yy05YjRlOWNiODIzZDQ=]
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDA1ODgzZC01ODYxLTQ3YjctOWQ3YS0xNzc2MjVkYTY4MTE7b2JqZWN0SWQ9MGE4NDgwYmQtMmI0MS00NDlmLWIxNmUtYmFkZDU2MTZhZTE1O3N1YnNjcmlwdGlvbklkPTI4YWVmYmU3LWUyYWYtNGI0YS05Y2UxLTkyZDY2NzJjMzFiZDt0ZW5hbnRJZD1jMmQ3MjNhMi00NzRlLTQ0ZDItYTM3Yy05YjRlOWNiODIzZDQ=]
module.swa.azurerm_static_web_app.swa: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.Web/staticSites/swa-ytsumm-prd]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.ContainerRegistry/registries/acrytsummprd]
module.key_vault.azurerm_key_vault.vault: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.KeyVault/vaults/kv-ytsumm-prd]
module.sql.azurerm_mssql_server.server: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.Sql/servers/sql-ytsumm-prd]
module.storage.azurerm_storage_account.storage: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.Storage/storageAccounts/stytsummprd]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.ContainerService/managedClusters/aks-ytsumm-prd]
module.sql.azurerm_mssql_firewall_rule.azure_services[0]: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.Sql/servers/sql-ytsumm-prd/firewallRules/AllowAzureServices]
module.sql.azurerm_mssql_database.database: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.Sql/servers/sql-ytsumm-prd/databases/ytsummarizer]
module.key_vault.azurerm_role_assignment.secrets_officer: Refreshing state... [id=/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.KeyVault/vaults/kv-ytsumm-prd/providers/Microsoft.Authorization/roleAssignments/fde6c717-0024-8ad6-efd0-ce353b6928f3]
module.storage.azurerm_storage_container.containers["embeddings"]: Refreshing state... [id=https://stytsummprd.blob.core.windows.net/embeddings]
module.storage.azurerm_storage_container.containers["transcripts"]: Refreshing state... [id=https://stytsummprd.blob.core.windows.net/transcripts]
module.storage.azurerm_storage_queue.queues["relationships-queue"]: Refreshing state... [id=https://stytsummprd.queue.core.windows.net/relationships-queue]
module.storage.azurerm_storage_queue.queues["summarize-queue"]: Refreshing state... [id=https://stytsummprd.queue.core.windows.net/summarize-queue]
module.storage.azurerm_storage_container.containers["summaries"]: Refreshing state... [id=https://stytsummprd.blob.core.windows.net/summaries]
module.storage.azurerm_storage_queue.queues["transcribe-queue"]: Refreshing state... [id=https://stytsummprd.queue.core.windows.net/transcribe-queue]
module.key_vault.azurerm_key_vault_secret.secrets["sql-connection-string"]: Refreshing state... [id=https://kv-ytsumm-prd.vault.azure.net/secrets/sql-connection-string/4814f544381d4354a1bc2b754ad633b5]
module.storage.azurerm_storage_queue.queues["embed-queue"]: Refreshing state... [id=https://stytsummprd.queue.core.windows.net/embed-queue]
module.key_vault.azurerm_key_vault_secret.secrets["storage-connection"]: Refreshing state... [id=https://kv-ytsumm-prd.vault.azure.net/secrets/storage-connection/4b95c33133f64a44b32aa8eec18fbd0a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.acr.azurerm_container_registry.acr will be updated in-place
  ~ resource "azurerm_container_registry" "acr" {
        id                            = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.ContainerRegistry/registries/acrytsummprd"
        name                          = "acrytsummprd"
        tags                          = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Project"     = "yt-summarizer"
        }
        # (17 unchanged attributes hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.ContainerService/managedClusters/aks-ytsumm-prd"
        name                                = "aks-ytsumm-prd"
        tags                                = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Project"     = "yt-summarizer"
        }
        # (28 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "default"
            tags                         = {}
            # (20 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.key_vault.azurerm_role_assignment.secrets_officer must be replaced
-/+ resource "azurerm_role_assignment" "secrets_officer" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.KeyVault/vaults/kv-ytsumm-prd/providers/Microsoft.Authorization/roleAssignments/fde6c717-0024-8ad6-efd0-ce353b6928f3" -> (known after apply)
      ~ name                             = "fde6c717-0024-8ad6-efd0-ce353b6928f3" -> (known after apply)
      ~ principal_id                     = "eac9556a-cd81-431f-a1ec-d6940b2d92d3" -> "0a8480bd-2b41-449f-b16e-badd5616ae15" # forces replacement
      ~ principal_type                   = "User" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sql.azurerm_mssql_database.database will be updated in-place
  ~ resource "azurerm_mssql_database" "database" {
        id                                                         = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.Sql/servers/sql-ytsumm-prd/databases/ytsummarizer"
        name                                                       = "ytsummarizer"
        tags                                                       = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Project"     = "yt-summarizer"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sql.azurerm_mssql_server.server will be updated in-place
  ~ resource "azurerm_mssql_server" "server" {
      ~ administrator_login_password             = (sensitive value)
        id                                       = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.Sql/servers/sql-ytsumm-prd"
        name                                     = "sql-ytsumm-prd"
        tags                                     = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Project"     = "yt-summarizer"
        }
        # (12 unchanged attributes hidden)
    }

  # module.storage.azurerm_storage_account.storage will be updated in-place
  ~ resource "azurerm_storage_account" "storage" {
        id                                = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.Storage/storageAccounts/stytsummprd"
        name                              = "stytsummprd"
        tags                              = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Project"     = "yt-summarizer"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.swa.azurerm_static_web_app.swa will be updated in-place
  ~ resource "azurerm_static_web_app" "swa" {
        id                                 = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.Web/staticSites/swa-ytsumm-prd"
        name                               = "swa-ytsumm-prd"
        tags                               = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Project"     = "yt-summarizer"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.

Changes to Outputs:
  ~ post_deploy_instructions = <<-EOT
      - ╔═══════════════════════════════════════════════════════════════════════════╗
      - ║ NEXT STEPS: Bootstrap Argo CD and Cluster Components                      ║
      - ╠═══════════════════════════════════════════════════════════════════════════╣
      - ║ 1. Get AKS credentials:                                                    ║
      - ║    az aks get-credentials --resource-group rg-ytsumm-prd --name aks-ytsumm-prd   ║
      - ║                                                                            ║
      - ║ 2. Bootstrap Argo CD:                                                      ║
      - ║    ./scripts/bootstrap-argocd.ps1                                          ║
      - ║                                                                            ║
      - ║ 3. Apply infrastructure apps (ingress-nginx, external-secrets):            ║
      - ║    kubectl apply -f k8s/argocd/infra-apps.yaml                             ║
      - ║                                                                            ║
      - ║ 4. Apply application configs:                                              ║
      - ║    kubectl apply -f k8s/argocd/prod-app.yaml                               ║
      - ║    kubectl apply -f k8s/argocd/preview-appset.yaml                         ║
      + ╔═══════════════════════════════════════════════════════════════════════════╗
      + ║ NEXT STEPS: Bootstrap Argo CD and Cluster Components                      ║
      + ╠═══════════════════════════════════════════════════════════════════════════╣
      + ║ 1. Get AKS credentials:                                                    ║
      + ║    az aks get-credentials --resource-group rg-ytsumm-prd --name aks-ytsumm-prd   ║
      + ║                                                                            ║
      + ║ 2. Bootstrap Argo CD:                                                      ║
      + ║    ./scripts/bootstrap-argocd.ps1                                          ║
      + ║                                                                            ║
      + ║ 3. Apply infrastructure apps (ingress-nginx, external-secrets):            ║
      + ║    kubectl apply -f k8s/argocd/infra-apps.yaml                             ║
      + ║                                                                            ║
      + ║ 4. Apply application configs:                                              ║
      + ║    kubectl apply -f k8s/argocd/prod-app.yaml                               ║
      + ║    kubectl apply -f k8s/argocd/preview-appset.yaml                         ║
        ╚═══════════════════════════════════════════════════════════════════════════╝
    EOT

Warning: Argument is deprecated

  with module.storage.azurerm_storage_container.containers["transcripts"],
  on ../../modules/storage/main.tf line 101, in resource "azurerm_storage_container" "containers":
 101:   storage_account_name  = azurerm_storage_account.storage.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 6 more similar warnings elsewhere)

Error: making Read request on Azure KeyVault Secret sql-connection-string: keyvault.BaseClient#GetSecret: Failure responding to request: StatusCode=403 -- Original Error: autorest/azure: Service returned an error. Status=403 Code="Forbidden" Message="Caller is not authorized to perform action on resource.\r\nIf role assignments, deny assignments or role definitions were changed recently, please observe propagation time.\r\nCaller: appid=f005883d-5861-47b7-9d7a-177625da6811;oid=0a8480bd-2b41-449f-b16e-badd5616ae15;iss=https://sts.windows.net/c2d723a2-474e-44d2-a37c-9b4e9cb823d4/\r\nAction: 'Microsoft.KeyVault/vaults/secrets/getSecret/action'\r\nResource: '/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourcegroups/rg-ytsumm-prd/providers/microsoft.keyvault/vaults/kv-ytsumm-prd/secrets/sql-connection-string'\r\nAssignment: (not found)\r\nDenyAssignmentId: null\r\nDecisionReason: 'DeniedWithNoValidRBAC' \r\nVault: kv-ytsumm-prd;location=eastasia\r\n" InnerError={"code":"ForbiddenByRbac"}

  with module.key_vault.azurerm_key_vault_secret.secrets["sql-connection-string"],
  on ../../modules/key-vault/main.tf line 106, in resource "azurerm_key_vault_secret" "secrets":
 106: resource "azurerm_key_vault_secret" "secrets" {


Error: making Read request on Azure KeyVault Secret storage-connection: keyvault.BaseClient#GetSecret: Failure responding to request: StatusCode=403 -- Original Error: autorest/azure: Service returned an error. Status=403 Code="Forbidden" Message="Caller is not authorized to perform action on resource.\r\nIf role assignments, deny assignments or role definitions were changed recently, please observe propagation time.\r\nCaller: appid=f005883d-5861-47b7-9d7a-177625da6811;oid=0a8480bd-2b41-449f-b16e-badd5616ae15;iss=https://sts.windows.net/c2d723a2-474e-44d2-a37c-9b4e9cb823d4/\r\nAction: 'Microsoft.KeyVault/vaults/secrets/getSecret/action'\r\nResource: '/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourcegroups/rg-ytsumm-prd/providers/microsoft.keyvault/vaults/kv-ytsumm-prd/secrets/storage-connection'\r\nAssignment: (not found)\r\nDenyAssignmentId: null\r\nDecisionReason: 'DeniedWithNoValidRBAC' \r\nVault: kv-ytsumm-prd;location=eastasia\r\n" InnerError={"code":"ForbiddenByRbac"}

  with module.key_vault.azurerm_key_vault_secret.secrets["storage-connection"],
  on ../../modules/key-vault/main.tf line 106, in resource "azurerm_key_vault_secret" "secrets":
 106: resource "azurerm_key_vault_secret" "secrets" {

::error::Terraform exited with code 1.
```

</details>

*Pushed by: @AshleyHollis, Action: `pull_request`*